app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."created_at" DESC  [["user_id", 4]]
---
  def index
    @tasks = current_user.tasks.order(created_at: :desc)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "RubyKaigiの復習を行う"], ["description", "URLはhttps://rubykaigi.org/2019"], ["created_at", "2019-05-01 14:49:12.705699"], ["updated_at", "2019-05-01 14:49:12.705699"], ["user_id", 4]]
---
  def create
    @task = current_user.tasks.new(task_params)
    if @task.save

UPDATE "tasks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "一覧表示機能の実装（編集済）"], ["description", "一覧アクションと一覧画面を実装する。\r\nあとで詳細、編集、削除のリンクを加える。"], ["updated_at", "2019-04-30 10:19:56.885524"], ["id", 1]]
---
  def update
    @task.update!(task_params)